#include <iostream>

// int main() {
//   std::cout << "Hello World!";
//   Map map_1;
//   return 0;
// }


// Map (словарь) - это ассоциативный контейнер, 
// содержащий отсортированные по возрастанию ключа пары ключ-значение. 
// То есть каждый элемент ассоциирован с некоторым уникальным ключом, 
// и его положение в словаре определяется его ключом. 
// Словари удобно применять, когда необходимо ассоциировать элементы 
// с некоторым другим значением (не индексом). 
// Например, предприятие осуществляет закупку оборудования, 
// причем каждую позицию приходится закупать неоднократно. 
// В таком случае удобно использовать словарь с парой 
// идентификатор позиции - объем закупки. 
// Здесь идентификатором может выступать не только число, но и строка. 
// Таким образом, поиск в словаре осуществляется не по индексу, как в массиве, 
// а по идентификатору - слову.
