#include "s21_set.h"

using namespace s21;

// void Set::DataTypeSize() {
//   std::cout << sizeof(value) << std::endl;
// }



// Set (множество) - это ассоциативный контейнер уникальных элементов. 
// Это означает, что в множество нельзя добавить один и тот же элемент дважды. 
// Контейнер множество является ассоциативным, 
// так как внутри он также представлен в виде дерева, как и контейнер map (словарь), 
// и, соответственно, также хранит элементы в отсортированном порядке. 
// Разница между словарем и множеством заключается в том, 
// что уникальным в множестве является, не ключ а само значение, 
// ровно как и поиск значения в дереве проверяется не по ключу, а по самому значению. 
// При добавлении уже существующего элемента в множество возникает 
// соответствующее исключение.







